FemDesign.Reinforcement.ReinforcementDirection
Reinforcement direction of a reinforcement layout.

FemDesign.Reinforcement.ReinforcementDirection.X
X-direction.

FemDesign.Reinforcement.ReinforcementDirection.Y
Y-direction